# PANDAS

In [2]:
import numpy as np
import pandas as pd

## Series
### is a one dimenssional array capable of holding any data type.
### the axis label are collectively called the index

In [3]:
# vertical way main jo bhi data stack karta hon ussay series kehtay hain
labels=['a','b','c','d']
my_list=[10,20,30,40]
arr=np.array([10,20,30,40])
d={1:10,2:20,3:30,4:40}

In [4]:
pd.Series(my_list)

0    10
1    20
2    30
3    40
dtype: int64

In [5]:
pd.Series(my_list,index=labels)  #actaullay in pandas label call the index

a    10
b    20
c    30
d    40
dtype: int64

In [6]:
pd.Series(d)

1    10
2    20
3    30
4    40
dtype: int64

## DataFrame
## jab series ko merge kartay ahin tu ussay kehtay hain dataframe

In [7]:
data={
    "Name":["Zain","Talha","Shahwaiz","Hanzalah"],
    "Age":[21,20,19,20],
    "City":["Kohat","karachi","Tando Allahyar","Lahore"],
    "Salary":["69000","180000","75000","31000"]
}
df=pd.DataFrame(data)
df

       Name  Age            City  Salary
0      Zain   21           Kohat   69000
1     Talha   20         karachi  180000
2  Shahwaiz   19  Tando Allahyar   75000
3  Hanzalah   20          Lahore   31000

In [8]:
data2={
    "Name":["Zain","Talha","Shahwaiz","Hanzalah"],
    "Age":[21,20,19,20],
    "City":["Kohat","karachi","Tando Allahyar","Lahore"],
    "Salary":["69000","180000","75000","31000"]
}
#change the cloumn Name
columns=["Firstname","Age_limit","Adress","Earning"]
df2=pd.DataFrame(data2,columns=columns)
df2

Empty DataFrame
Columns: [Firstname, Age_limit, Adress, Earning]
Index: []

In [9]:
# Select Cloumn
df["Name"]

0        Zain
1       Talha
2    Shahwaiz
3    Hanzalah
Name: Name, dtype: object

In [10]:
# when we select 2 columns
df[["Name","Age"]]

       Name  Age
0      Zain   21
1     Talha   20
2  Shahwaiz   19
3  Hanzalah   20

In [11]:
#  how create new column
df["Designation"]=["Web Devloper","Computer Science","ChatBot","Data Analyst"]
df

       Name  Age            City  Salary       Designation
0      Zain   21           Kohat   69000      Web Devloper
1     Talha   20         karachi  180000  Computer Science
2  Shahwaiz   19  Tando Allahyar   75000           ChatBot
3  Hanzalah   20          Lahore   31000      Data Analyst

In [12]:
# How to remove the colmun 
# axis=0 row and axis=1 column
df.drop("Designation",axis=1,inplace=True)
df
# Jab hum main data say delete krna chaihain tu inplace=True Lagaingay

       Name  Age            City  Salary
0      Zain   21           Kohat   69000
1     Talha   20         karachi  180000
2  Shahwaiz   19  Tando Allahyar   75000
3  Hanzalah   20          Lahore   31000

In [13]:
# or agar ek say ziyada delete karna hai tu is tarah likhaingay
df.drop(["City","Salary"],axis=1,inplace=True)
df

       Name  Age
0      Zain   21
1     Talha   20
2  Shahwaiz   19
3  Hanzalah   20

In [14]:
# Jab hum row ko delete karaingay tu locations ko bhi use karaingay
data3={
    "Name":["Zain","Talha","Shahwaiz","Hanzalah"],
    "Age":[21,20,19,20],
    "City":["Kohat","karachi","Tando Allahyar","Lahore"],
    "Salary":["69000","180000","75000","31000"]
}
df3=pd.DataFrame(data3)
df3

       Name  Age            City  Salary
0      Zain   21           Kohat   69000
1     Talha   20         karachi  180000
2  Shahwaiz   19  Tando Allahyar   75000
3  Hanzalah   20          Lahore   31000

In [15]:
df3.loc[0]

Name       Zain
Age          21
City      Kohat
Salary    69000
Name: 0, dtype: object

In [16]:
# iloc ko kehtay hain index location
# yaani hum index saybhi delete kartay hain

In [17]:
# Selecting subsetting of rows and column
df3.loc[[0,1]][["City","Salary"]]

      City  Salary
0    Kohat   69000
1  karachi  180000

### Conditional Selection

In [18]:
df3

       Name  Age            City  Salary
0      Zain   21           Kohat   69000
1     Talha   20         karachi  180000
2  Shahwaiz   19  Tando Allahyar   75000
3  Hanzalah   20          Lahore   31000

In [19]:
df3[df3["Age"] > 20]

   Name  Age   City Salary
0  Zain   21  Kohat  69000

In [20]:
df3[(df3["Age"] >20 ) & (df3["City"]=="Kohat")]

   Name  Age   City Salary
0  Zain   21  Kohat  69000

## Missing Data

In [21]:
data={
    "A":[1,2,np.nan,4,5],
    "B":[1,2,3,4,5],
    "C":[1,2,3,np.nan,np.nan],
    "D":[1,np.nan,np.nan,np.nan,5]
}
df=pd.DataFrame(data)
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [22]:
df.isna()

       A      B      C      D
0  False  False  False  False
1  False  False  False   True
2   True  False  False   True
3  False  False   True   True
4  False  False   True  False

In [23]:
df.isna().sum()
# yeh bata raha kay kis cloumn main kitnay null values hain

A    1
B    0
C    2
D    3
dtype: int64

In [24]:
# row say null value ko delete karna hai
df.dropna()

     A  B    C    D
0  1.0  1  1.0  1.0

In [25]:
# thrshold ka mutlub apkay pass 3 non nan value honi chaiye
df.dropna(thresh=3)

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
4  5.0  5  NaN  5.0

## Filing Data

In [26]:
# remove kaylie dropna()
# search kaylie   isna()
#or Filling kaylie filna()
df.fillna(0)

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  0.0
2  0.0  3  3.0  0.0
3  4.0  4  0.0  0.0
4  5.0  5  0.0  5.0

In [27]:
# har column kaylie  different value
values={"A":5,"B":8,"C":10,"D":6}
df.fillna(value=values)

     A  B     C    D
0  1.0  1   1.0  1.0
1  2.0  2   2.0  6.0
2  5.0  3   3.0  6.0
3  4.0  4  10.0  6.0
4  5.0  5  10.0  5.0

In [28]:
df.fillna(df.mean())

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  3.0
2  3.0  3  3.0  3.0
3  4.0  4  2.0  3.0
4  5.0  5  2.0  5.0

### Merging Joining and concatination

In [29]:
employees = pd.DataFrame({
    'employee_id': [1, 2, 3, 4, 5],
    'name': ['John', 'Anna', 'Peter', 'Linda', 'Bob'],
    'department': ['HR', 'IT', 'Finance', 'IT', 'HR']
})

salaries = pd.DataFrame({
    'employee_id': [1, 2, 3, 6, 7],
    'salary': [60000, 80000, 65000, 70000, 90000],
    'bonus': [5000, 10000, 7000, 8000, 12000]
})

In [30]:
employees

   employee_id   name department
0            1   John         HR
1            2   Anna         IT
2            3  Peter    Finance
3            4  Linda         IT
4            5    Bob         HR

In [31]:
salaries

   employee_id  salary  bonus
0            1   60000   5000
1            2   80000  10000
2            3   65000   7000
3            6   70000   8000
4            7   90000  12000

In [32]:
pd.merge(employees,salaries,on="employee_id",how="inner")

   employee_id   name department  salary  bonus
0            1   John         HR   60000   5000
1            2   Anna         IT   80000  10000
2            3  Peter    Finance   65000   7000

In [33]:
pd.merge(employees,salaries,on="employee_id",how="outer")

   employee_id   name department   salary    bonus
0            1   John         HR  60000.0   5000.0
1            2   Anna         IT  80000.0  10000.0
2            3  Peter    Finance  65000.0   7000.0
3            4  Linda         IT      NaN      NaN
4            5    Bob         HR      NaN      NaN
5            6    NaN        NaN  70000.0   8000.0
6            7    NaN        NaN  90000.0  12000.0

In [34]:
pd.merge(employees,salaries,on="employee_id",how="left")

   employee_id   name department   salary    bonus
0            1   John         HR  60000.0   5000.0
1            2   Anna         IT  80000.0  10000.0
2            3  Peter    Finance  65000.0   7000.0
3            4  Linda         IT      NaN      NaN
4            5    Bob         HR      NaN      NaN

In [35]:
pd.merge(employees,salaries,on="employee_id",how="right")

   employee_id   name department  salary  bonus
0            1   John         HR   60000   5000
1            2   Anna         IT   80000  10000
2            3  Peter    Finance   65000   7000
3            6    NaN        NaN   70000   8000
4            7    NaN        NaN   90000  12000

### Concatenation of 2 DataFrame

In [36]:
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2'],
    'C': ['C0', 'C1', 'C2']
})

df2 = pd.DataFrame({
    'A': ['A3', 'A4', 'A5'],
    'B': ['B3', 'B4', 'B5'],
    'C': ['C3', 'C4', 'C5']
})
df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [37]:
pd.concat([df1,df2])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

### Joining of 2 DataFrame

In [38]:
df1 = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Charlie']
}, index=[1, 2, 3])

df2 = pd.DataFrame({
    'score': [85, 90, 75]
}, index=[2, 3, 4])

In [39]:
df1.join(df2)

      name  score
1    Alice    NaN
2      Bob   85.0
3  Charlie   90.0

### GROUP BY & AGREGRATION

In [40]:
data = {
    'Category': ['A', 'B', 'A', 'B', 'A', 'B', 'A', 'B'],
    'Store': ['S1', 'S1', 'S2', 'S2', 'S1', 'S2', 'S2', 'S1'],
    'Sales': [100, 200, 150, 250, 120, 180, 200, 300],
    'Quantity': [10, 15, 12, 18, 8, 20, 15, 25],
    'Date': pd.date_range('2023-01-01', periods=8)
}
df = pd.DataFrame(data)
df

  Category Store  Sales  Quantity       Date
0        A    S1    100        10 2023-01-01
1        B    S1    200        15 2023-01-02
2        A    S2    150        12 2023-01-03
3        B    S2    250        18 2023-01-04
4        A    S1    120         8 2023-01-05
5        B    S2    180        20 2023-01-06
6        A    S2    200        15 2023-01-07
7        B    S1    300        25 2023-01-08

In [41]:
cat=df.groupby("Category")["Sales"].sum()
cat

Category
A    570
B    930
Name: Sales, dtype: int64

### Agregration
### mean median mode std variance min max count

In [42]:
df["Sales"].mean()

np.float64(187.5)

In [43]:
df['Sales'].agg(['sum','mean','min','max','count','std','median'])

sum       1500.000000
mean       187.500000
min        100.000000
max        300.000000
count        8.000000
std         66.062741
median     190.000000
Name: Sales, dtype: float64

# Pivote Tables
### Rows aur Columns ke basis par data ko organize karna.

### Aggregation functions (mean, sum, count, max, min, etc.) apply karna.

### Complex datasets ko easily summarize karna.

In [44]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West',
               'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary',
            'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice']
}

df = pd.DataFrame(data)
df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    969     13   John  January      Q1
1  2023-01-02       B   West    359     20   Mary  January      Q1
2  2023-01-03       C  North    357     16    Bob  January      Q1
3  2023-01-04       D  South    360     13  Alice  January      Q1
4  2023-01-05       A   East    174     42   John  January      Q1
5  2023-01-06       B   West    726     98   Mary  January      Q1
6  2023-01-07       C  North    554     25    Bob  January      Q1
7  2023-01-08       D  South    788     54  Alice  January      Q1
8  2023-01-09       A   East    328     32   John  January      Q1
9  2023-01-10       B   West    207     48   Mary  January      Q1
10 2023-01-11       C  North    203     11    Bob  January      Q1
11 2023-01-12       D  South    916     38  Alice  January      Q1
12 2023-01-13       A   East    953     16   John  January      Q1
13 2023-01-14       B   West    246     72   Mary  January      Q1
14 2023-01-15       C  North    798     72    Bob  January      Q1
15 2023-01-16       D  South    937     34  Alice  January      Q1
16 2023-01-17       A   East    324     70   John  January      Q1
17 2023-01-18       B   West    930     26   Mary  January      Q1
18 2023-01-19       C  North    653     52    Bob  January      Q1
19 2023-01-20       D  South    180     41  Alice  January      Q1

In [45]:
pd.pivot_table(df,values='Sales',index="Region",columns='Product',aggfunc='median')

Product      A      B      C      D
Region
East     328.0    NaN    NaN    NaN
North      NaN    NaN  554.0    NaN
South      NaN    NaN    NaN  788.0
West       NaN  359.0    NaN    NaN

In [46]:
pivot2 = pd.pivot_table(df, values=['Sales', 'Units'], index='Region', columns='Product')
pivot2

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     549.6    NaN    NaN    NaN  34.6   NaN   NaN   NaN
North      NaN    NaN  513.0    NaN   NaN   NaN  35.2   NaN
South      NaN    NaN    NaN  636.2   NaN   NaN   NaN  36.0
West       NaN  493.6    NaN    NaN   NaN  52.8   NaN   NaN

## Cross tab
### we use counting functions

In [47]:
pd.crosstab(df['Region'],df['Product'])

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0

# Operations

In [48]:
df1 = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50],
    'C': [100, 200, 300, 400, 500]
})
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [49]:
df1.shape

(5, 3)

In [50]:
df1.columns

Index(['A', 'B', 'C'], dtype='object')

In [51]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
dtypes: int64(3)
memory usage: 252.0 bytes

In [52]:
df1.describe()

              A          B           C
count  5.000000   5.000000    5.000000
mean   3.000000  30.000000  300.000000
std    1.581139  15.811388  158.113883
min    1.000000  10.000000  100.000000
25%    2.000000  20.000000  200.000000
50%    3.000000  30.000000  300.000000
75%    4.000000  40.000000  400.000000
max    5.000000  50.000000  500.000000

In [53]:
df1['A'] + 10

0    11
1    12
2    13
3    14
4    15
Name: A, dtype: int64

In [54]:
def square(x):
    return x**2
df1["B"].apply(square)

0     100
1     400
2     900
3    1600
4    2500
Name: B, dtype: int64